# expense = input()
# expense = expense.replace(',', '').replace(' ', '')
# arr = expense.split('+')
# del arr[-1]
# total_expense = 0
# for ar in arr:
#     total_expense += int(ar)
# print(total_expense)

total_expense = 853285
# total_expense/23 = 37099.34782608696   하루에 37100원
# 나 여행다닌건가?ㅋㅋㅋ 미쳤어..


# income = True
# total_income = 0
# count = -1
# while income:
#     income = int(input())
#     total_income += income
#     count += 1
# print(total_income, count)

total_income = 645000
# 한달 용돈 30만원, 할아버지 용돈, 20만원, 고모 용돈 5만원,  생활용품 9.5만원


# print(total_expense - total_income)
rest = 208285
# 수입 - 지출 = 208285원
# 이러다 나 거지 되겠어...


'''옷 쇼핑: 19회, 257425원 (평균 13549원) '''
# 10회, 1만원 옷
# 6회, 600원 양말
# 1회, 15000원 워커
# 1회, 4만원 트렌치코트
# 1회, 99900원 블랙코트

'''생필용품 및 장보기: 8회 133740원 '''
# 3회, 노브랜드: 16300원, 41140원, 21220원
# 4회, 마트: 31480원, 11620원, 3980원
# 1000 칫솔
# 7000 달팽이크림

'''밥: 19회, 173370원 (평균 9125원)'''
# 3회, 깨돌이: 2500, 4000, 6500
# 2회, GS25: 8000, 770
# 2회, 소풍: 8500, 8000
# 7500 짬뽕
# 8000 미슐랭만두
# 13500 수원역 포장마차
# 4500 맘스터치
# 5000 외대학식
# 7000 명량떡볶이
# 17000 명륜진사
# 24100 스시마이우
# 6500 삼겹살
# 10500 샤브칼국수
# 12000 카레
# 19500 행복치킨


'''카페: 19회, 57400원 (평균 3021원) '''
# 11회, 무인카페:  1400원*8회, 1900원*2회, 2500원*1회
# 6회, 투썸:  4000원*2회, 3800원, 4500원, 5000원, 100원
# 2회, 에이비카페:  6500원, 12000원

'''고정: 134990원'''
# 3회, 1만원 헌금
# 1회, 7만원 데이트통장
# 1회, 14990원 폰요금
# 1회, 2만원 청약

'''데이트: 4회, 41490원 (평균 10323원) '''
# 3회, 한결이 간식: 1990원, 4400원, 10100원
# 1회, 호텔비: 10100원

'''음료: 3600원'''
# 2회, 삼다수: 950
# 음료 1700원

'''선물: 13000원'''
# 대추빵 1만원
# 이모티콘 3000원

'''교통비: 38350원'''
# SRT: 33700원
# 광역알뜰카드: 1250원
# 외대셔틀: 3400원